Revit 2024 API
ViewSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ViewSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ViewSetIterator
Visual C++
public:
virtual ViewSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
ViewSet Class
Autodesk.Revit.DB Namespace